Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--osgeolive_install_quickstart.tmx
Source language: en
Languages: ja

source: Install OSGeoLive to Hard Disk
ja: ハードディスクに OSGeoLive をインストール

source: OSGeoLive can be installed onto your hard disk, the same way an Ubuntu distribution is installed.
ja: OSGeoLive は Ubuntu をインストールするのと同様にハードディスクにインストールして利用できます。

source: This process can also be run inside a Virtual Machine to create a permanent OSGeoLive Virtual Machine from a DVD or ISO image.
ja: OSGeoLive の DVD や ISO イメージから、永続的な仮想マシンを作成するために、仮想マシン内でインストールすることもできます。

source: System Requirements
ja: 動作環境

source: |osgeolive-hdspace| of spare Hard Disk Space
ja: |osgeolive-hdspace| のハードディスクが必要となります

source: Install OSGeoLive
ja: OSGeoLive のインストール

source: Select :guilabel:`Install RELEASE`
ja: :guilabel:`Install RELEASE` を選択します

source: Enter password="user"
ja: パスワード "user" を入力します

source: Select language
ja: 言語を選択します

source: Select timezone
ja: タイムゾーンを選択します

source: Select keyboard
ja: キーボードを選択します

source: Specify which disk to want to install on. (Beware, this may delete an existing installed partition).
ja: インストールするディスクを指定してください。(インストールされている既存のパーティションが削除される可能性があることに注意してください)。

source: Defaults for settings are:
ja: デフォルトでは以下のような設定になっています:

source: Select :guilabel:`Install`
ja: :guilabel:`Install` を選択します

source: Go and get a cup of coffee while installation is in progress.
ja: インストールが終わるまでしばらくお待ちください。

source: That is it.
ja: これで終了です。

source: Installation Tips In case you are installing using a username other than "user", tomcat applications require to have permission to service command as described in https://trac.osgeo.org/osgeo/ticket/1153
ja: インストール Tips: ユーザ名に "user" 以外を指定してインストールした場合、Tomcat アプリケーションでは https://trac.osgeo.org/osgeo/ticket/1153 に記載のように、サービスコマンドへの権限が必要となります

source: See Also:
ja: 参照:
